Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་ཀྱི་ཡུལ་གྱིས་ལྷའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་ངོ་།
en: Through the domain of the Buddha, they also saw the divine, miraculously created ornaments.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The bodhisattva great beings and great hearers then thought, “We should go to see and examine the presence of that great assembly and the qualities of the buddha field.

source: བདག་ཅག་ཀྱང་འདུས་པ་ཆེན་པོའི་བཀོད་པ་དེ་དག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དེ་དག་བལྟ་བ་དང་། བརྟག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཡང་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་དེར་འདོང་ངོ་། །དེར་ནི་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡང་ཐོབ་པར་འགྱུར་གོར་མ་ཆག་སྙམ་མོ།
en: We should go to see, venerate, and serve the thus-gone Śākyamuni. There we will definitely receive our prophecies of unsurpassed and perfect awakening!”

source: །དེ་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་མི་སྣང་བར་གྱུར་ཏེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ཉིད་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏོ།
en: Through the thus-gone Śākyamuni’s miraculous power, bodhisattva great beings and great hearers as numerous as the atoms in all the buddha fields throughout the ten directions then disappeared from their own buddha fields and arrived instantaneously in this Sahā world.

source: །དེའི་ཚེ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་རྣམས་ཀྱང་འདིར་ལྷགས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ས་དང་ནམ་མཁའི་བར་མ་ལུས་པར་གང་བར་གྱུར་ཏོ།
en: When the countless, limitless bodhisattva great beings, who were as numerous as the atoms in all the buddha fields, arrived from each of the ten directions, they filled the earth and the sky above this buddha field entirely.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་ཀྱི་རྒྱུ་འཐུན་པའི་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ།
en: Due to the power of the cause that is in accord with these bodhisattva great beings’ roots of virtue, they set out venerating the thus-gone Śākyamuni.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་དག་གིས་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་གྱིས་ཁེབས་པར་བྱས་སོ།
en: In order to venerate the Blessed One, some bodhisattva great beings covered the entire buddha field with a rain of various flowers, while others cast down showers of pearls, and so forth.

source: །ལ་ལ་དག་གིས་ནི་མུ་ཏིག་གི་ཆར་ཕབ་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལ་ལ་དག་གིས་ནི་གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་དང་། གོ་ཤིར་ཥ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། ཤིང་ཏ་མ་ལའི་ལོ་མའི་ཕྱེ་མའི་ཆར་གྱིས་ནམ་མཁའ་ཁེབས་པར་བྱས་སོ།
en: In order to venerate the Blessed One, yet others cast down showers of gold, silver, beryl, crystal, emerald, coral, white sandalwood, uraga sandalwood, and the powdered leaves of the palm tree, thus filling the sky.

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལ་ལ་དག་གིས་ནི་ལྷབ་ལྷུབ་དང་། ཕྱང་འཕྲུལ་དང་། རྒྱན་དང་། རས་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་བོ།
en: In order to venerate the Blessed One, others cast down a rain of dangling and swaying ornaments and various cloth and linens.

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལ་ལ་དག་གིས་ནི་རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྣ་ཚོགས་བསྒྲེང་ངོ་།
en: In order to venerate the Blessed One, some held up jeweled parasols, banners, and flags.

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལ་ལ་དག་གིས་ནི་སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་སོ།
en: In order to venerate the Blessed One, some anointed the earth with various scents.

source: །ལ་ལ་དག་གིས་ནི་རིན་པོ་ཆེའི་ཕྲེང་བ་སྣ་ཚོགས་གཏོར་ཏོ།
en: Some tossed jeweled garlands.

source: །ལ་ལ་དག་གིས་ནི་སིལ་སྙན་དང་དཀྲོལ་བ་སྣ་ཚོགས་དཀྲོལ་ཏོ།
en: Some played instruments and cymbals.

source: །ལ་ལ་དག་གིས་ནི་གླུ་དང་གར་དང་། རོལ་མོའི་སྒྲ་རབ་ཏུ་བསྟན་ཏོ།
en: Some sang and danced. Some played music.

source: །ལ་ལ་དག་གིས་ནི་ས་ཕྱོགས་དེར་སྤོས་ཆུ་སྣ་ཚོགས་ཀྱི་ཆར་གྱིས་ཆག་ཆག་བཏབ་བོ།
en: Some cleansed the earth with scented water.

source: །ལ་ལ་དག་གིས་ནི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་རྣམས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བཀང་སྟེ།
en: Some bore jeweled vessels containing jewels to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་ཐོགས་སོ། །ལ་ལ་དག་གིས་ནི་རིན་པོ་ཆེའི་སྣོད་སྣ་ཚོགས་རྣམས་སྤོས་ཆུས་བཀང་སྟེ། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་མས་བརྒྱན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་ཐོགས་སོ།
en: Some filled jeweled vessels with scented water, decorated them with flowers, fruits, and leaves, and bore them to the Blessed One.

source: །ལ་ལ་དག་གིས་ནི་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ལྷའི་གོས་དང་། རྒྱན་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་ནས་འཕང་སྟོད་དེ་ཐོགས་སོ།
en: Some decorated jeweled trees with divine cloth, jewelry, flowers, and fruits and held them high.

source: །ལ་ལ་དག་གིས་ནི་བདག་ཉིད་ཚངས་པ་ཆེན་པོའི་ཆ་བྱད་དུ་མངོན་པར་སྤྲུལ་ཏེ། ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱས་ཏེ།
en: Some transformed themselves into the guise of Mahābrahmā and prostrated to the Blessed One with palms joined together.

source: འཁོད་པ་ནས་རྒྱ་ཆེར་ཇི་ལྟར་གོང་དུ་སྨོས་པ་བཞིན་ནོ།
en: Standing there, they made extensive offerings in the manner just mentioned.

source: །ལ་ལ་དག་ནི་སེང་གེའི་ཆ་བྱད་དུ་མངོན་པར་སྤྲུལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་འཁོད་དོ།
en: Some transformed themselves into the guise of lions, prostrated to the Blessed One, and took their places.

source: །བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་མཐུ་དང་། རང་གི་དགེ་བའི་རྩ་བའི་སྟོབས་བསྐྱེད་པས་སེམས་ཅན་དེ་དག་ཕན་ཚུན་མིག་གི་དབང་པོས་གཟུགས་སྣང་བ་རྣམས་ལ་ཐགས་ཐོགས་མེད་དོ།
en: Drawing on the Blessed One’s miraculous power and the strength of their own roots of virtue, the beings there were able to perceive one another’s forms unimpededly with their own eyes.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱང་དེ་ལྟ་བུའི་བདུད་ཀྱི་ཡུལ་ཆེན་པོ་ལྷའི་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་རྣམས་དང་། རང་གི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་ཡུལ་གྱི་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་ནས་སྲང་གི་དབུས་ན་པད་མ་ཡོད་པ་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས། ཕྱག་གཡས་པའི་མཐིལ་གྱིས་པད་མའི་སྙིང་པོ་ལ་རེག་པར་མཛད་དེ་དྲངས་ནས་བཞུགས་སོ།
en: The Blessed One then entered the city of Rājagṛha through the transformative power of the gods of the great māra realm, as well as his own applications of mindfulness, right exertions, bases of supernatural power, faculties, strengths, limbs of awakening, paths, and eighteen unique qualities of a buddha. He then proceeded to a lotus that was right in the center of the road, touched the head of the flower with his right palm, and picked it up.

source: །པད་མ་དེ་དྲངས་ཏེ་གཡོས་པས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་རི་ཁོར་ཡུག་དང་། རི་ཁོར་ཡུག་ཆེན་པོ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་དང་། རྒྱ་མཚོ་ཆེན་པོ་དང་། བདུད་ཀྱི་གནས་ཐམས་ཅད་ཀྱང་གཡོས་སོ།
en: As he plucked the lotus , it vibrated, which caused all the encircling mountains, greater encircling mountains, Mount Sumeru, the great oceans, and all the māra realms in this buddha field to shake.

source: །བདུད་ཀྱི་གནས་ཐམས་ཅད་ན་གཞལ་མེད་ཁང་དང་། གནས་ཁང་དང་། མལ་ཆ་དང་། སྟན་རྣམས་ཀྱང་རབ་ཏུ་གཡོས་སོ།
en: The celestial palaces, abodes, beds, and seats in the māra realms also shook violently.

source: །དེ་ན་གང་བདུད་ཀྱི་བུ་རྣམས་དང་། བདུད་ཀྱི་བུ་མོ་རྣམས་དང་། བདུད་ཀྱི་ཚོགས་ཀྱི་འཁོར་གནས་པ་དེ་དག་ཀྱང་འཇིགས་སྐྲག་ཅིང་སྐྱོ་བ་སྐྱེས་ནས་ཕན་ཚུན་འདི་སྐད་འཛེར་ཏོ། །རྒྱུ་མེད་རྐྱེན་མེད་པར་ནི་གཞལ་མེད་ཁང་འདི་དག་གཡོ་བར་མི་འགྱུར་ན། བདག་ཅག་གི་རྒྱལ་པོ་བདུད་དེ་རང་གི་ཡུལ་ནས་འཕོས་པར་མ་གྱུར་གྲང་།
en: All the māra boys and girls and their retinues there were terrified and worried and said to one another, “Since our celestial palaces do not shake for no reason, perhaps Māra , our king, has passed from his domain?

source: བདག་ཅག་ཀྱང་ཁང་པ་འདི་ནས་འཆི་འཕོ་བའི་ཆོས་འབྱུང་བར་མི་འགྱུར་གྲང་།
en: What if we are also to die and pass from our home?

source: བདག་ཅག་གིས་བལྟ་གོར་མ་ཆག་གོ་སྙམ་སྟེ།
en: We should definitely go to see what is happening!”

source: དེ་ནས་དེ་དག་གིས་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནི་སྙིགས་མ་ལྔ་ཅན་དུ་གྱུར་ན།
en: Once they saw what had happened, they thought, “If this buddha field is influenced by the five degenerations, who has then ornamented it so?

source: འདི་སུས་ལེགས་པར་བརྒྱན་ཅིང་ཤིན་ཏུ་ཉམས་དགའ་བར་བྱས་སྙམ་མོ།
en: Who has made it so pleasant?”

source: །དེ་ནས་རང་གི་ཡུལ་ལ་གནས་པའི་བདུད་གཡོག་དང་བཅས་པ་དེ་དག་དེ་ན་འཁོད་བཞིན་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་ཤིན་ཏུ་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེར་བཞུགས་པ་མཐོང་ངོ་།
en: Then, as the māras and their servants were standing in that place, they saw the thus-gone Śākyamuni seated there—shining, gleaming, brilliant, and adorned with the thirty-two marks of a great being.

source: །ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ཀྱང་སེམས་ཅན་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་སྣ་ཚོགས་སུ་གནས་པ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་ནས་སེམས་ཅན་གཅིག་ཀྱང་ངོ་མི་ཤེས་ཏེ།
en: They did not recognize even a single one of the many other beings of various forms, colors, characteristics, and shapes that existed in the whole trichiliocosm, including this entire buddha field.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་པར་མཐོང་ངོ་།
en: Yet they saw each of those beings exerting themselves in venerating the Blessed One.

source: །དེ་ནས་དེ་དག་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། ད་ལྟར་བདག་ཅག་གི་ཇོ་བོ་དང་། གཡོག་ཏུ་བཅས་པ་གར་དོང་བ་ཡང་དྲི་བའི་ཕྱིར་དེར་འདོང་གོར་མ་ཆག་སྙམ་མོ།
en: It then occurred to them, “We must by all means go to see the thus-gone Śākyamuni, pay our respects to him, and ask him where our leader and his servants have gone.”

source: །དེ་ནས་ཡང་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་པོ་དེ་དག་ཐམས་ཅད་གཡོག་དང་བཅས་པར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་སྤྱན་སྔར་འཁོད་དོ། །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The billion māras together with their retinues arrived in the presence of Blessed Śākyamuni and took their seats. Māra , the evil one, bowed with folded hands in the direction of the Blessed One and said: “Blessed One!

source: །རབ་ཏུ་རྣམ་པར་དད་སེམས་ཀྱིས།
en: With faith born in my mind,

source: །བཅོམ་ལྡན་བདག་ནི་སྐྱབས་སུ་མཆི།
en: I am going to take refuge in you.

source: །བདག་ཁྲོལ་འདི་ནས་མྱུར་དུ་ཐོང་།
en: Promptly release me from my chains

source: །ཆོས་ནི་ཡང་དག་སྤྱད་པར་བགྱི།
en: And I will authentically practice the Dharma.”

source: །འགྲོ་བ་དང་ནི་འོང་བ་ཡང་། །ངས་ནི་སུ་ལའང་བཟློག་པ་མེད།
en: From coming or leaving.

source: །གལ་ཏེ་ལམ་ནི་རབ་ཤེས་ན།
en: If you know the way,

source: །གང་དུ་དགའ་བར་འགྲོ་བར་བྱོས།
en: You are free to go wherever you please.”

source: །བདུད་སྡིག་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The evil one said: “Whenever I try to go as I like

source: །རང་གི་སྤྱོད་ཡུལ་གར་དགའ་བར།
en: To my own domain,

source: །གང་ཚེ་བདག་ནི་མཆི་འཚལ་ཏེ།
en: O Gautama, I find myself tied

source: །བདག་ནི་བཅིང་བ་ལྔ་དག་གིས། །བཅིངས་པར་མཐོང་ངོ་གཽ་ཏ་མ།
en: With a fivefold noose!”

source: ང་ནི་རྟོག་པ་ཀུན་སྤངས་ཏེ།
en: “All my concepts have ceased;

source: །གྲོལ་ནས་འགྲོ་བ་གྲོལ་བྱེད་པ།
en: I am liberated and thus liberate beings.

source: །ངས་ནི་འཚེ་བ་རྣམ་སྤངས་ནས།
en: I have given up harming others

source: །སེམས་ཅན་བཅིངས་པ་ཐར་བར་བྱ།
en: And now liberate beings from bondage.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ས་དང་ནམ་མཁའ་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཡོངས་སུ་གང་བ་ལ་གཟིགས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: The Blessed One then looked with his buddha eye at the entire buddha field and, seeing it completely filled with beings that live on earth and in the sky, recited the following stanzas:

source: །འདིར་ལྷགས་པ་དག་ཐམས་ཅད་ཀྱང་།
en: “Hear now my advice, all of you, With a focused mind!

source: །ཐེ་ཙོམ་ཐམས་ཅད་རབ་སྤོངས་ལ།
en: Cast away all your doubts

source: །སྐད་ཅིག་ཅི་ཡང་མ་སྨྲ་བར།
en: And then keep quiet!

source: །ཁྱོད་ཅག་རྣམས་ནི་ད་ཉོན་ཅིག །རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དཀོན།
en: “A fully realized Buddha, the Dharma, and the Saṅgha

source: །ཆོས་དང་དགེ་འདུན་ཤིན་ཏུ་དཀོན།
en: Are hard to find in this world.

source: །དད་ཅིང་མོས་པ་འབྱོར་པ་དང་། །བྱང་ཆུབ་སྤྱོད་པ་ཤིན་ཏུ་དཀོན།
en: Hard to find are faith, sincere application, And the practice of awakening. “It is rare to be able to hear the Dharma

source: །འཇིག་རྟེན་མགོན་པོའི་མངོན་སུམ་དུ། །ཆོས་ཉན་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: From the protector of the world himself.

source: །གང་དུ་བཟོད་པ་སྟེན་བྱེད་པ། །དེ་ཡི་དུས་ནི་རྙེད་པར་དཀའ།
en: It is difficult to find the right time To train in patience.

source: །གང་དུ་འཇིག་རྟེན་སྡིག་པ་ཡི།
en: “It is rare in this world

source: །རྟོག་པ་ཐམས་ཅད་རབ་སྤོང་བ།
en: To be able to relinquish negative conceptual thinking,

source: །སྟོང་པ་ཉིད་ནི་བསྒོམ་པ་དང་། །སེམས་ནི་དུལ་བར་བྱེད་པ་དཀོན།
en: To cultivate emptiness, And to tame the mind.

source: །ཇི་ལྟར་ངས་ནི་སྔོན་སྤྱད་པའི།
en: “The conduct of awakening, as I had formerly practiced,

source: །བྱང་ཆུབ་སྤྱོད་པ་རྙེད་པར་དཀའ། །དེ་ལས་མེ་ཏོག་ཙམ་ཚོད་འདི།
en: Is difficult to find.

source: །ཁྱེད་ཅག་རྣམས་ལ་བཤད་པར་བྱ།
en: I will teach you therefore

source: །གང་གིས་བྱང་ཆུབ་འབྱོར་བྱེད་པ། །སྲིད་པའི་བཅིངས་ལས་རབ་གྲོལ་ཞིང་།
en: How it should be fostered. “I will teach the greatest of paths

source: །མུན་པའི་ཕུང་པོ་སེལ་བ་ཡི།
en: That dispels the mass of darkness,

source: །ལམ་གྱི་མཆོག་ནི་བསྟན་པར་བྱ།
en: Connects us to awakening, And totally liberates us from the fetters of existence.

source: །དྲི་མ་ངན་པ་གསུམ་སྤོངས་ལ།
en: “You should cast away the three stains

source: །སྟོན་པས་གསུངས་པ་འདིར་ཉོན་ཅིག །ཆུ་བོ་རྣམས་ཀྱི་ཕ་རོལ་རྒོལ།
en: And listen to the teacher’s instructions.

source: །རྒྱ་མོ་ཅན་གྱི་སྲེད་པ་སྤོངས།
en: Having cast off the snare of craving, You should cross to the other shore of the four rivers.

source: །རྣམ་ཐར་གསུམ་ལ་རབ་གནས་ཤིང་།
en: “You must win the threefold liberation,

source: །སྡོམ་པ་གསུམ་ལ་ཡང་དག་གནས།
en: Establish yourselves in the three types of restraint,

source: །ཁམས་གསུམ་ཀུན་གྱི་ཉོན་མོངས་གང་། །དེ་དག་མ་ལུས་རྣམ་པར་ཆོམ།
en: And then remove all of the afflictions there are

source: །དཀོན་མཆོག་གསུམ་གྱི་རིགས་མཆོད་དང་། །ཆོས་ཀྱི་དོན་དུ་ཁྱེད་ཅག་རྣམས།
en: In the threefold universe.

source: །སངས་རྒྱས་ལྷ་དང་བདུད་གསུམ་གྱི།
en: “To worship the lineage of the Three Jewels

source: །བྱིན་རླབས་སྤྲུལ་པས་ལྷགས་པ་རྣམས།
en: And for the sake of Dharma, All of you gathered here should scrupulously eliminate

source: །དུས་གསུམ་མ་རིག་བསྒྲིབས་པའི་སེམས། །བྱེ་བྲག་ཏུ་ནི་རབ་ཏུ་སྤོངས།
en: The ignorance of the three times that obscures the mind.

source: །ཁམས་གསུམ་པ་ལས་གྲོལ་བ་ཡི།
en: “Through the emanation of the blessings Of the buddhas, gods, and māras,

source: །ཞི་བྱེད་བཟོད་པ་ཐོབ་པར་བྱོས།
en: Obtain a pacifying acceptance

source: །ཕྱིན་ཅི་ལོག་ནི་རྣམ་བཞི་ཡིས།
en: That is beyond the threefold universe.

source: །སོ་སོའི་སྐྱེ་བོ་བསླད་པ་རྣམས།
en: “Ordinary beings Spoiled by the four errors,

source: །དངོས་པོ་མེད་ལ་རྟོག་བྱེད་པ།
en: Who conceptualize nonthings,

source: །དེ་དག་བཟོད་པའི་སྣོད་མ་ཡིན།
en: Are not vessels for this acceptance.

source: །མིག་ནི་གཟུགས་ལ་ཆགས་པ་ཡིས།
en: “When the visual faculty is attached to form

source: །ལུས་དང་ངག་དང་སེམས་བསྒྲིབས་ནས།
en: It obscures body, speech, and mind.

source: །བསམ་གཏན་བཞི་དང་བྲལ་བ་རྣམས།
en: Those who are devoid of the four concentrations

source: །འཁོར་བ་ཤིན་ཏུ་བསྟེན་པར་འགྱུར།
en: Obsess over saṃsāra.

source: །འཇིག་རྟེན་ན་ནི་གང་མཁས་གསལ།
en: “Those whose learnedness illuminates the world—

source: །བསམ་གཏན་སྒོམ་པ་བྱེད་པ་རྣམས།
en: Those who cultivate concentration— Could today be liberated

source: །དེ་དག་ཕྱིན་ཅི་ལོག་བཞི་ལས། །དེ་རིང་རྣམ་པར་གྲོལ་བར་འགྱུར།
en: From the four errors.

source: །དབང་ཕྱུག་དེ་དག་སེམས་ཅན་རྣམས།
en: “These lords save beings

source: །ཆུ་བོ་བཞི་ལས་ཐར་བར་བྱེད།
en: From the four rivers.

source: །འཆི་འཕོ་སྐྱེ་བ་རབ་ཤེས་པ།
en: Those who gain a certain understanding of birth and death

source: །དེས་པ་རྣམས་ནི་ཕ་རོལ་འགྲོ།
en: Cross to the far shore.

source: །བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་པ།
en: “Fearless bodhisattvas

source: །རྐང་པ་བཞི་དང་ལྡན་པ་དག །སེམས་ཅན་སྲེད་པས་བཅིངས་པ་རྣམས།
en: Endowed with four limbs Break the bonds that bind beings to existence

source: །ཡང་དག་ཤེས་པས་གཅོད་པར་བྱེད།
en: By means of correct knowledge.

source: །ཕུང་པོ་ལྔ་རྣམས་ཡོངས་ཤེས་པས།
en: “By totally comprehending the five aggregates,

source: །ཞགས་པ་ལས་གྲོལ་ཟག་པ་མེད།
en: One is freed from their noose.

source: །ཡང་དང་ཡང་དུ་མི་སྐྱེ་སྟེ།
en: No longer driven into endless rebirths,

source: །སྲིད་པའི་རྒྱ་མཚོའི་ཕ་རོལ་ཕྱིན།
en: One has crossed to the far shore of the ocean of existence. “You should confess your wrongdoings

source: །སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་སྔར་ཁྱེད། །སྡིག་པ་དག་ནི་མྱུར་དུ་ཤོགས།
en: In front of the buddhas

source: །སྡིག་པ་མ་ལུས་རབ་སྤོངས་ལ།
en: And, having abandoned all negativity,

source: །འཇིགས་པ་མེད་པར་ཕ་རོལ་སོང་།
en: Fearlessly reach the far shore.

source: །སྲིད་པར་ཡང་དང་ཡང་སྐྱེས་པས།
en: “By repeatedly taking rebirth in existence

source: །སྡིག་པའི་གྲོགས་ཀྱི་དབང་སོང་བས།
en: And coming under the influence of evil companions,

source: །འཁོར་བའི་སྡུག་བསྔལ་དེ་དག་ནི།
en: One experiences the sufferings

source: །འདུས་བྱས་ལ་ཡང་མྱོང་བར་འགྱུར།
en: Of saṃsāra and conditioned phenomena.

source: །སྡིག་པའི་གྲོགས་པོ་རབ་སྤོངས་ཏེ།
en: “Steering clear of wicked friends

source: །སྡིག་པའི་ལྟ་བ་རྣམས་བོར་ནས།
en: And wrong views,

source: །འཁོར་བའི་སྡུག་བསྔལ་དྲན་བྱས་ཏེ།
en: And remembering the suffering of saṃsāra,

source: །དམ་པའི་ཆོས་ལ་རབ་སྦྱོར་ཅིག །བཏུང་བའི་དམ་པ་འཐུང་བར་བྱོས།
en: Apply yourselves to the sublime Dharma. “Drink this finest elixir.

source: །སྟོང་པ་ཉིད་ཀྱང་རབ་སྒོམས་ཤིག །དམ་པའི་དོན་ལ་དངོས་པོ་མེད།
en: Meditate on emptiness. From the point of view of the absolute truth,

source: །རྫས་ཀྱང་མེད་ཅིང་མཚན་ཉིད་མེད།
en: There are no objects, no substantiality, and no characteristics.

source: །འདི་ལྟར་དབང་པོ་དྲུག་སྟོང་སྟེ།
en: “As the five sense organs are empty,

source: །བྱེད་པ་པོ་ནི་འདི་ལ་མེད།
en: No agent can be found there.

source: །དེ་བཞིན་མཚན་མར་རྟོག་པ་ཡང་།
en: What are merely entities characterized by thoughts

source: །དངོས་པོ་ཙམ་སྟེ་གཡོ་བ་མེད།
en: Are likewise inactive.

source: །ཚོར་བ་དྲུག་དང་སྲེད་པ་དྲུག །རེག་པ་དྲུག་ལས་བྱུང་བ་ཡིན།
en: “The six sensations and six forms of craving Arise from the six types of contact.

source: །དེ་བཞིན་རེག་པའི་སྐྱེ་མཆེད་དྲུག །སྟོང་པ་ཡིན་པར་ཤེས་པར་བྱོས།
en: In the same way, you should understand That the five sense bases arising from contact are empty. “Consider how one imputes ‘thingness’

source: །རང་བཞིན་གྱིས་ནི་དངོས་མེད་པར། །དངོས་པོ་ཉིད་ལ་བརྟག་པར་བྱོས།
en: To what is naturally not a thing.

source: །སྐྱེ་བ་མེད་ཅིང་འགག་མེད་པས།
en: Beings unborn and unceasing—

source: །འདི་ན་རྫས་ཀྱང་མེད་པར་ལྟོས།
en: Consider how insubstantial they are.

source: །གང་གིས་ཆོས་ཀུན་ཚུལ་གཅིག་སྟེ།
en: “All phenomena are subsumed under a single principle

source: །དུས་གསུམ་དུ་ཡང་དངོས་མེད་པར།
en: And have no ‘thingness’ in any of the three times.

source: །ཤེས་པ་དེ་དག་ནད་མེད་དེ།
en: Those who know this will be free from fever;

source: །དེ་ནི་བླ་ན་མེད་པའི་ལམ།
en: This is the unsurpassed path.

source: །རྣམ་པ་བཅུ་གསུམ་ངེས་གྲོལ་ལ།
en: “Freedom is certain in these thirteen respects. It is the cultivation of acceptance

source: །སེམས་ཅན་འདུ་ཤེས་རྣམ་འཇིག་ཅིང་།
en: That destroys the perceptions of beings And liberates subjectivity.”

source: །ཚུ་རོལ་ཕ་རོལ་རྣམ་གྲོལ་བ། །དེ་ནི་བཟོད་པ་བསྒོམ་པ་ཡིན། །དེ་ནས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་བསོད་ནམས་ཀྱི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པའི་ཤུགས་དང་། དགེ་བའི་རྩ་བའི་རྒྱུ་འཐུན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྒྲ་ཐོགས་པ་མེད་པས་ཚིགས་སུ་བཅད་པ་དེ་དག་གསུངས་པ་དེའི་མོད་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་པ་དང་། མི་སྟོང་པའི་སྙིགས་མ་ལྔ་ཅན་གང་གཱའི་ཀླུང་དཔག་ཏུ་མེད་པ་མི་འཁྲུགས་པའི་བྱེ་མ་སྙེད་རྣམས་སུ་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པ་འདི་དག་གྲགས་པར་གྱུར་ནས།
en: When through the power of the Blessed One’s merit, his strength of fearlessness, and the influence of his merit according to his roots of virtue he chanted these verses with the unimpeded sound of his voice, his words of the maṇḍala of space were heard throughout the ten directions in worlds—with and without the five degenerations—equal in extent to the infinite grains of sand in the Gaṅgā.

source: །དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནི་ཤིན་ཏུ་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་། དད་པ་རྙེད་དེ།
en: Immediately, infinite hundreds of thousands of millions of billions of beings in every buddha field obtained faith and undefiled joy.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: They proceeded irreversibly to unsurpassed and perfect awakening.

source: །ལ་ལ་དག་གིས་ནི་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་སྣ་ཚོགས་ཐོབ་བོ།
en: Some attained absorption, acceptance, or different dhāraṇīs.

source: །སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འདུས་པའི་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་ནི་དོན་དང་། ཚིག་དང་། ཡི་གེ་འདི་དག་ཐོས་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were gathered in this buddha field obtained the level of irreversibility when they heard the Blessed One’s words, syllables, and meaning.

source: །སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནི་ཐེག་པ་གསུམ་པོ་དག་གིས་ངེས་པར་འབྱུང་བ་ཐོབ་པར་གྱུར་ཏོ།
en: Infinite numbers of beings attained renunciation according to one of the three vehicles.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བས་པད་མའི་ཁྲི་ལ་འཛེག་པར་བྱ་བའི་ཕྱིར་རང་གི་རྫུ་འཕྲུལ་གྱི་མཐུས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཐེམ་སྐས་མེ་ཏོག་གིས་ཀུན་ཏུ་གཡོགས་པ་མངོན་པར་སྤྲུལ་སྟེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཐམས་ཅད་མཁྱེན་པ་རྒ་ཤི་མྱ་ངན་གྱི།
en: Jyotīrasa, the bodhisattva great being, magically created the stairs, made of the seven precious gems and shaded with flowers, for ascending to the lotus throne and, with hands folded in the direction of the Blessed One, implored:

source: །འདམ་དུ་བྱིང་བའི་འཇིག་རྟེན་ཐམས་ཅད་ལ།
en: “O omniscient one, gaze upon the entire world

source: །རབ་ཏུ་གཟིགས་ཏེ་མི་རྒྱུ་རྒྱུར་བཅས་ཀྱི།
en: Sunk in the mire of aging and death’s agonies.

source: །འཇིག་རྟེན་དུ་ནི་ཆོས་ཀྱི་ཟམ་པ་ཐོགས།
en: Raise the Dharma bridge For the animate and inanimate worlds. “Gaze upon your field into which have been born

source: །ཐལ་མོ་སྦྱར་བའི་སེམས་ཅན་རྒྱ་ཆེན་བརྒྱས། །རབ་ཏུ་བལྟམ་པའི་ཞིང་ལ་གཟིགས་ནས་སུ།
en: Myriads of beings with folded hands.

source: །ཆོས་ཀྱི་མཆོད་སྦྱིན་རབ་ཏུ་བགོ་བར་གསོལ།
en: Distribute your Dharma gifts!

source: །རང་གི་མཐུ་རྩལ་རབ་ཏུ་བསྟན་དུ་གསོལ། །མཚུངས་པ་མེད་པའི་པད་མ་མངོན་འཛེགས་ཏེ།
en: Show us your miraculous power! “For those tormented by the afflictions,

source: །མགོན་པོ་ཤེས་རབ་དང་ནི་ཐབས་རྣམས་ཀྱིས།
en: Reveal the knowledge and the means! Ascend to the peerless lotus seat, O Lord,

source: །ཆོས་ཆུ་སྤྲིན་གྱིས་ཆར་པ་རབ་ཕོབ་ལ། །ཉོན་མོངས་གཟིར་བའི་མི་ལ་བསྟན་དུ་གསོལ།
en: And rain down the rain of the Dharma.

source: །ཕྱོགས་བཅུ་དག་གི་སངས་རྒྱས་ཐམས་ཅད་དང་། །དྲང་སྲོང་ཆེན་པོ་ཤེས་རབ་ལྡན་པ་གཞན།
en: “With all the buddhas in the ten directions And other wise sages here as your witnesses,

source: །ཁྱོད་ཀྱི་དཔང་དུ་དེ་དག་ཀུན་བཞུགས་ཀྱིས།
en: Leader of the victors,

source: །ཐུབ་པའི་དཔང་པོ་བདུད་རྣམས་ཕམ་པར་མཛོད།
en: Destroy the māras!

source: །ཆོས་རྣམས་སྟོང་པ་ནམ་མཁའ་ལྟ་བུ་དང་། །ངོ་བོ་ཉིད་ཀྱིས་ཡ་མ་བརླར་མཁྱེན་ནས།
en: “Knowing that all phenomena are empty like space And inseparable from their intrinsic nature,

source: །སྔོན་གྱི་དམ་བཅས་རྣམས་ནི་དགོངས་མཛོད་ལ།
en: Remember your past promises!

source: །བླ་མེད་འཁོར་ལོ་དམ་པ་བསྐོར་དུ་གསོལ།
en: Turn the unsurpassed and sublime wheel! “O lion among humans, liberate now

source: །ཆུ་བོ་བཞི་དབུས་འཁོར་བའི་སེམས་ཅན་རྣམས།
en: The beings swirling in the midst of the four rivers.
